### pandas

In [1]:
import pandas as pd
import numpy as np

In [3]:
sports1=pd.Series([11,12,13,14],index=["cricket","football","baseball","kabadi"])
sports1

cricket     11
football    12
baseball    13
kabadi      14
dtype: int64

In [5]:
sports2=pd.Series([22,34,21,14],index=["cricket","football","basketball","kho-kho"])
sports2

cricket       22
football      34
basketball    21
kho-kho       14
dtype: int64

In [6]:
sports1+sports2

baseball       NaN
basketball     NaN
cricket       33.0
football      46.0
kabadi         NaN
kho-kho        NaN
dtype: float64

In [10]:
table=pd.DataFrame(np.random.rand(8,5),index='A B C D E F G H'.split(),columns='score1 score2 score3 score4 score5'.split())
table

     score1    score2    score3    score4    score5
A  0.888682  0.697583  0.970712  0.909992  0.192995
B  0.507020  0.250607  0.654698  0.034391  0.903969
C  0.136136  0.521797  0.828755  0.023213  0.293713
D  0.874481  0.047630  0.783201  0.237308  0.229176
E  0.715064  0.710685  0.143891  0.289447  0.248761
F  0.001716  0.607863  0.048958  0.302552  0.798209
G  0.869843  0.017865  0.825071  0.003196  0.649703
H  0.736487  0.241742  0.775097  0.056466  0.616004

In [12]:
table['score1']

A    0.888682
B    0.507020
C    0.136136
D    0.874481
E    0.715064
F    0.001716
G    0.869843
H    0.736487
Name: score1, dtype: float64

In [16]:
table[['score1','score2','score3']] #double brackets

     score1    score2    score3
A  0.888682  0.697583  0.970712
B  0.507020  0.250607  0.654698
C  0.136136  0.521797  0.828755
D  0.874481  0.047630  0.783201
E  0.715064  0.710685  0.143891
F  0.001716  0.607863  0.048958
G  0.869843  0.017865  0.825071
H  0.736487  0.241742  0.775097

In [55]:
table2={'Id':[101,102,103,104,105,106], 'Name':["rajesh","sangamesh","rahul","ravi","uthkarsh","vivek"],'Profit':[50,60,64,70,89,35]}
fd=pd.DataFrame(table2)
fd

    Id       Name  Profit
0  101     rajesh      50
1  102  sangamesh      60
2  103      rahul      64
3  104       ravi      70
4  105   uthkarsh      89
5  106      vivek      35

In [50]:
df4=pd.DataFrame(np.random.rand(4,4),index='20 30 40 39'.split(),columns="S1 S2  S3  S4".split())
df4

          S1        S2        S3        S4
20  0.382046  0.442083  0.610014  0.707316
30  0.470233  0.207911  0.302387  0.313264
40  0.999050  0.700376  0.142395  0.979425
39  0.740694  0.075764  0.615653  0.052332

In [57]:
fd[["Id","Name"]] #remeber its not table2 but fd

    Id       Name
0  101     rajesh
1  102  sangamesh
2  103      rahul
3  104       ravi
4  105   uthkarsh
5  106      vivek

In [63]:
fd=fd.drop("Id",axis=1)

KeyError: "['Id'] not found in axis"

In [64]:
fd.drop(3) # id is not there

        Name  Profit
0     rajesh      50
1  sangamesh      60
2      rahul      64
4   uthkarsh      89
5      vivek      35